package Lesson2;
/*
Написать метод, которому в качестве параметра передается целое число.
Метод должен вернуть true, если число отрицательное,
 и вернуть false если положительное. Замечание: ноль считаем положительным числом.
 */
public class Method3 {
    public static boolean checkPositivity2(int a) {
        return a >= 0;
    }

//    public static void main(String[] args) {
//        System.out.println(checkPositivity2(-7));
//
//    }

}
